export interface City {
  [key: string]: string[];
}

export interface Prefecture {
  [key: string]: City;
}

export interface JapanRegions {
  [region: string]: {
    [prefecture: string]: string[]; // 都道府県が市区町村の配列を持つ
  };
}

const japanRegions: JapanRegions = {
  "北海道・東北": {
    "北海道": ["札幌市", "旭川市", "函館市"],
    "青森県": ["青森市", "弘前市", "八戸市"],
    // 他の県...
  },
  "関東": {
    "東京都": ["千代田区", "新宿区", "渋谷区"],
    "神奈川県": ["横浜市", "川崎市", "相模原市"],
    // 他の県...
  },
  "中部": {
    "愛知県": ["名古屋市", "豊田市", "岡崎市"],
    "静岡県": ["静岡市", "浜松市", "沼津市"],
    // 他の県...
  },
  "近畿": {
    "大阪府": ["大阪市", "堺市", "東大阪市"],
    "京都府": ["京都市", "宇治市", "舞鶴市"],
    // 他の県...
  },
  "中国": {
    "広島県": ["広島市", "福山市", "呉市"],
    "岡山県": ["岡山市", "倉敷市", "津山市"],
    // 他の県...
  },
  "四国": {
    "愛媛県": ["松山市", "今治市", "新居浜市"],
    "香川県": ["高松市", "丸亀市", "坂出市"],
    // 他の県...
  },
  "九州": {
    "福岡県": ["福岡市", "北九州市", "久留米市"],
    "熊本県": ["熊本市", "八代市", "天草市"],
    // 他の県...
  },
};

export default japanRegions;